Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad
The AnalysisDecomposedAreaLoad class contains decomposed area load information.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad._Direction
The direction of the analysis decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad._Positions
The positions of the analysis decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad._Magnitudes
The magnitudes of the analysis decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad.Direction
The direction of the decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad.Positions
The positions of the decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad.Magnitudes
The magnitudes of the decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad.Select
Selects an analysis decomposed area load.

Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad.SelectInstance
DO NOT USE! For internal usage only!